_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_РесурснаяСтоимостьПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_РесурснаяСтоимостьПозиции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыНормативныхСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыНормативныхСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПусконаладочныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтноСтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеставрационноВосстановительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническоеОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаЭксплуатациюМашин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогШтучныхКонструкций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прейскурант0608НаСборныйЖелезобетон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантыНаРемонтТехнологическогоОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантОптовыхЦенНаМатериалыИОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеныНаМестныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УкрупненныеСметныеНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеЗатратыВЗимнееВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержаниеОбъектовГородскойСреды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременныеЗданияИСооружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калькуляция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестныйМатериал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВариантыРасчетаЗМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВариантыРасчетаЗМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Усредненный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_СметаРасчетРесурсныйСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Рассчитывает составляющие затрат (ПЗ, ОЗ ...) для ресурсного метода.
//
// Параметры:
//     Позиция 						- ДокументСсылка.СМ_ПозицияЛокальнойСметы, ДокументОбъект.СМ_ПозицияЛокальнойСметы - объект позиции.
//     СтруктураДанныхРасчета 		- Структура - содержит таблицы данных для расчета (см. менеджер СМ_ПозицияЛокальнойСметы).
//     ЛС 							- ДокументСсылка.СМ_ЛокальнаяСмета, ДокументОбъект.СМ_ЛокальнаяСмета - ссылка на локальную смету.  
//     Акт 							- ДокументСсылка.СМ_АктыВыполненныхРабот, ДокументОбъект.СМ_АктыВыполненныхРабот - если задан акт,
//                    				  передается ссылка на него.
//     СтруктураПараметровОтбораРС	- Структура - содержит ссылки на объекты для отборов РС (можно получить методом
//                                    СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(..).
//     ИспользоватьРС 				- Булево - если Ложь, то все считается без чтения и записи из РС.
//
// Возвращаемое значение:
//     Результат - Булево - расчет выполнен успешно.
//
Функция РасчитатьСоставляющиеЗатратПриРесурсномРасчете(Позиция, СтруктураДанныхРасчета, ЛС, Акт, СтруктураПараметровОтбораРС = Неопределено, ИспользоватьРС = Ложь) Экспорт
	
	Если СтруктураПараметровОтбораРС = Неопределено Тогда
		СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(Позиция, Акт, "СМ_ПозицияЛокальнойСметы");
	КонецЕсли;
	
	Если СтруктураПараметровОтбораРС.СсылкаНаАкт = Неопределено Тогда
		
		ОбъемРабот = Позиция.ОбъемРабот;
		ОкрИтог = ЛС.ОкруглятьДоРублей;
		ПромОкр = ЛС.ПромежуточноеОкругление;
		ОбрабПогр = ЛС.ОбрабатыватьПогрешность;
		
	Иначе
		
		СтрокаВАкте = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция);
		Если Не СтрокаВАкте = Неопределено Тогда
			ОбъемРабот = СтрокаВАкте.ФактОбъем;
		Иначе 
			ТекущийОбъем = 0;
		КонецЕсли;	
		ОкрИтог = Акт.ОкруглятьДоРублей;
		ПромОкр = Акт.ПромежуточноеОкругление;
		ОбрабПогр = Акт.ОбрабатыватьПогрешность;
		
	КонецЕсли;            	
	
	// Если транспортировка, то рассчитывается не по ресурсам, а по текущей цене. 
	ТЧ = Позиция.РесурсыПозицииЛокальнойСметы;
	МассивРесурсов = ТЧ.НайтиСтроки(Новый Структура("Удален",Ложь));
	НаличиеРесурсов = МассивРесурсов.Количество();
	
	Если Позиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Работа
		И НаличиеРесурсов > 0 Тогда
		
		Результат = РасчетПоРесурсам(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС);
		
	ИначеЕсли Позиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
		
		Результат = РасчетДляОборудования(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС);
		
	ИначеЕсли Позиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал Тогда
		
		Результат = РасчетДляМатериала(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС);
		
	Иначе	
		
		Результат = РасчетПрочего(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС);
		
	КонецЕсли;
	
	Возврат Результат;
	
		
КонецФункции

// Рассчитывает сумму вспомогательных ресурсов позиции.
//
// Параметры:
//     Позиция 		- ДокументОбъект.СМ_ПозицияЛокальнойСметы, ДокументСсылка.СМ_ПозицияЛокальнойСметы - 
//                    позиция локальной сметы.  
//     тчРесурсы 	- ТаблицаЗначений - таблица ресурсов и их стоимостей.
//	   Акт 			- ДокументСсылка.СМ_АктыВыполненныхРабот, ДокументОбъект.СМ_АктыВыполненныхРабот - если задан акт,
//                    передается ссылка на него.
//
// Возвращаемое значение:
//     ТекСтоимРесурса - Число - величина стоимости вспомогательных ресурсов.
//
Функция РассчитатьСтоимостьВспомогательных(Позиция, тчРесурсы, Акт = Неопределено) Экспорт 

	Коэффициент 		= 1;      
	КоличествоРесурса 	= 0;
	ФОТ 				= 0;
	
	Если Позиция.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.ТехническоеОбслуживание Тогда
		Коэффициент = Константы.СМ_ПроцентДляТЕРмр.Получить();
	ИначеЕсли Позиция.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.МонтажныеРаботы Тогда	
		Коэффициент = Константы.СМ_ПроцентДляТЕРм.Получить();
	КонецЕсли;
	
	Коэффициент = Коэффициент / 100;  
	Коэфф 		= 0; 
	НаимФК 		= "";
	Для Каждого СтрТЧ Из тчРесурсы Цикл  
		Если СтрТЧ.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
			НормаРасхода 		= СтрТЧ.НормаРасхода * ?(стрТЧ.КоэффициентКРасходуРесурсов=0,1,стрТЧ.КоэффициентКРасходуРесурсов);
			ФОТ 				= ФОТ + СтрТЧ.ТекущаяЦена;  
			КоличествоРесурса 	= КоличествоРесурса + НормаРасхода; 
			// ******************************************************
			// ++ AVV Ошибки учета ресурсов акта
			Если Акт = Неопределено Тогда
				Для Каждого СтрокаТаблПоправок Из Позиция.ПоправкиПозиции Цикл
					Если НЕ СтрокаТаблПоправок.Применить Тогда
						Продолжить;
					КонецЕсли;
					Если СтрокаТаблПоправок.КоэффТР <> 0 Тогда
						КоличествоРесурса = КоличествоРесурса * СтрокаТаблПоправок.КоэффТР;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			// -- AVV
			// ******************************************************
		КонецЕсли;	
	КонецЦикла;	
	
	ТекСтоимРесурса = ФОТ * Коэффициент * КоличествоРесурса;     
	
	Возврат(ТекСтоимРесурса);
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Рассчитать зарплату по среднему методу.
//
Функция РассчитатьЗПМУсредненый(Позиция,тчРесурсы,Вид,Норма = Неопределено)
	
	Цена  = 0;
	Для каждого СтрокаПозиции Из тчРесурсы Цикл
		Если СтрокаПозиции.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
			Если Норма = Неопределено Тогда
				Норма = СтрокаПозиции.НормаРасхода;
			КонецЕсли;
			цена = СтрокаПозиции[Вид];
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если Норма = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Коэффициент = 0;
	Для каждого СтрокаПоправок Из Позиция.ПоправкиПозиции Цикл
		Если СтрокаПоправок.Применить Тогда
			Коэффициент = Коэффициент + СтрокаПоправок.КоэффТМ;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Коэффициент = 0 Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	итог = Норма * Коэффициент * Цена;
	
	Возврат Итог;
	
КонецФункции

// Рассчитать стоимость по ресурсам.
//
Функция РасчетПоРесурсам(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС = Ложь)
	
	Если ИспользоватьРС Тогда
		НаборЗаписей = РегистрыСведений.СМ_РесурснаяСтоимостьПозиции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции = НаборЗаписей.Выгрузить();
	КонецЕсли;
	
	СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Очистить();
	                  	
	КЧ = Новый КвалификаторыЧисла(20,6);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	тчПозиции = Позиция.РесурсыПозицииЛокальнойСметы.Выгрузить(Новый Структура("Удален",Ложь));
	
	Если Акт <> Неопределено Тогда
		// Для акта получим таблицу.
		ФактОбъем = 0;
		СтрокаПозиции = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция, Ложь);
		Если  СтрокаПозиции <> Неопределено Тогда
			ФактОбъем = СтрокаПозиции.ФактОбъем;
		КонецЕсли;	
		тчПозиции.колонки.добавить("ФактРасходаОбъем",		ОписаниеТиповЧ);
		тчПозиции.Очистить();
		масПозиции = СМ_СметаВызовСервера.МассивСтрокРесурсовПозицииАкта(Акт, СтруктураПараметровОтбораРС.СсылкаНаПозицию); 
		// Преобразуем для общего вида.
		Для Каждого Стр Из масПозиции Цикл
			Если Не Стр.Удален Тогда
				// ****************************************************
				// ++ AVV Ошибки учета ресурсов акта
				НоваяСтрокаПозиции = тчПозиции.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПозиции,Стр);
				НоваяСтрокаПозиции.НормаРасхода = ?(ФактОбъем <> 0,Стр.НормаРасходаОбъем/ФактОбъем,0);
				// -- AVV 
				// ****************************************************
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	тчПозиции.колонки.добавить("СтоимостьБазисная",		ОписаниеТиповЧ);
	тчПозиции.колонки.добавить("СтоимостьТекущая",		ОписаниеТиповЧ);
	тчПозиции.колонки.добавить("СтоимостьБазиснаяЗМ",	ОписаниеТиповЧ);
	тчПозиции.колонки.добавить("СтоимостьТекущаяЗМ",	ОписаниеТиповЧ);
	
	НеУчитывать40 = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","Группа40");	
	РасчетСтоимостиВспомогательныхМатериалов = Константы.СМ_РасчетСтоимостиВспомогательныхМатериаловОЗМонтажников.Получить();
	Попытка
		КодВспомогательногоМатериала = Константы.СМ_ВспомогательныеМатериалы.Получить().Код;
	Исключение
		КодВспомогательногоМатериала = "";
	КонецПопытки;
	
	Для Каждого Стр Из тчПозиции Цикл
		
		Если стр.ТипМатериала = Перечисления.СМ_ТипыМатериалов.Учтенный Тогда
			Если Акт <> Неопределено Тогда
				Если ФактОбъем <> 0  Тогда
					стр.СтоимостьБазисная	= стр.БазиснаяЦена * стр.ФактРасходаОбъем / ФактОбъем;
					ТекСтоимостьРесурса	= стр.ТекущаяЦена  * стр.ФактРасходаОбъем / ФактОбъем;
				Иначе
					стр.СтоимостьБазисная = 0;
					ТекСтоимостьРесурса	= 0;
				КонецЕсли;
			Иначе
				стр.СтоимостьБазисная	= стр.БазиснаяЦена * (стр.НормаРасхода * ?(стр.КоэффициентКРасходуРесурсов=0,1,стр.КоэффициентКРасходуРесурсов));
				ТекСтоимостьРесурса	= стр.ТекущаяЦена  * (стр.НормаРасхода * ?(стр.КоэффициентКРасходуРесурсов=0,1,стр.КоэффициентКРасходуРесурсов));
			КонецЕсли;
			
			Если РасчетСтоимостиВспомогательныхМатериалов Тогда
				Если стр.СметныйКодРесурса = КодВспомогательногоМатериала Тогда
					// ****************************************************
					// ++ AVV Ошибки учета ресурсов акта
					ТекСтоимостьРесурса = РассчитатьСтоимостьВспомогательных(Позиция, тчПозиции, Акт);
					// -- AVV
					// ****************************************************
				КонецЕсли;
			КонецЕсли;
			
			стр.СтоимостьТекущая	= ТекСтоимостьРесурса;
			
			Если ЛС.ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Расчетный  Тогда
				Если Акт <> Неопределено Тогда
					Если ФактОбъем <> 0  Тогда
						стр.СтоимостьБазиснаяЗМ = стр.БазиснаяЗарплатаМашинистов * стр.ФактРасходаОбъем / ФактОбъем;
					Иначе
						стр.СтоимостьБазиснаяЗМ = 0;
					КонецЕсли;	
					Если Лев(стр.СметныйКодРесурса,2) = "40" И НеУчитывать40 = Истина Тогда
						стр.СтоимостьТекущаяЗМ  = 0;
					Иначе
						Если ФактОбъем <> 0  Тогда
							стр.СтоимостьТекущаяЗМ  = стр.ТекущаяЗарплатаМашинистов  * стр.ФактРасходаОбъем / ФактОбъем;
						Иначе		
							стр.СтоимостьТекущаяЗМ  = 0;
						КонецЕсли;
					КонецЕсли;
					
				Иначе	
					стр.СтоимостьБазиснаяЗМ = стр.БазиснаяЗарплатаМашинистов * ( стр.НормаРасхода * ?(стр.КоэффициентКРасходуРесурсов=0,1,стр.КоэффициентКРасходуРесурсов));
					Если Лев(стр.СметныйКодРесурса,2) = "40" И НеУчитывать40 = Истина Тогда
						стр.СтоимостьТекущаяЗМ  = 0;
					Иначе
						стр.СтоимостьТекущаяЗМ  = стр.ТекущаяЗарплатаМашинистов  * (стр.НормаРасхода * ?(стр.КоэффициентКРасходуРесурсов=0,1,стр.КоэффициентКРасходуРесурсов));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если стр.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов
				И ЛС.ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Усредненный Тогда
				
				Норма = Неопределено;
				Если Не Акт = Неопределено Тогда
					Норма = стр.ФактРасходаОбъем / ФактОбъем;
				КонецЕсли;
				
				стр.СтоимостьБазиснаяЗМ = РассчитатьЗПМУсредненый(Позиция,тчПозиции,"БазиснаяЦена",Норма);
				стр.СтоимостьТекущаяЗМ  = РассчитатьЗПМУсредненый(Позиция,тчПозиции,"ТекущаяЦена",Норма);
			КонецЕсли;
			
		Иначе
			
			стр.СтоимостьБазисная	= 0;
		 	стр.СтоимостьТекущая	= 0;
		 	стр.СтоимостьБазиснаяЗМ = 0;
		 	стр.СтоимостьТекущаяЗМ  = 0; 
			
		КонецЕсли;
	КонецЦикла;	
	
	тчПозиции.Свернуть("ВидРесурса","СтоимостьБазисная,СтоимостьТекущая,СтоимостьБазиснаяЗМ,СтоимостьТекущаяЗМ");
	
	СтрокаРасчета = СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Добавить();
	Для каждого стрПозиции Из  тчПозиции Цикл
		Если стрПозиции.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
			СтрокаРасчета.СтоимОснЗарплата 			= ?(ПромОкр,Окр(стрПозиции.СтоимостьБазисная,2),стрПозиции.СтоимостьБазисная);
			СтрокаРасчета.ТекСтоимОснЗарплата 		= ?(ПромОкр,Окр(стрПозиции.СтоимостьТекущая,2),стрПозиции.СтоимостьТекущая);
			СтрокаРасчета.ЗатратыТрудаРабочих		= Позиция.ЗатратыТрудаРабочих;
		ИначеЕсли стрПозиции.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
			СтрокаРасчета.СтоимЭксплМашин 			= ?(ПромОкр,Окр(стрПозиции.СтоимостьБазисная,2),стрПозиции.СтоимостьБазисная);
			СтрокаРасчета.ТекСтоимЭксплМашин 		= ?(ПромОкр,Окр(стрПозиции.СтоимостьТекущая,2),стрПозиции.СтоимостьТекущая);
			Если ЛС.ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Расчетный Тогда
				СтрокаРасчета.СтоимЗарплМашин 		= ?(ПромОкр,Окр(стрПозиции.СтоимостьБазиснаяЗМ,2),стрПозиции.СтоимостьБазиснаяЗМ);
				СтрокаРасчета.ТекСтоимЗарплМашин 	= ?(ПромОкр,Окр(стрПозиции.СтоимостьТекущаяЗМ,2),стрПозиции.СтоимостьТекущаяЗМ);
			КонецЕсли;
		ИначеЕсли стрПозиции.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
			СтрокаРасчета.СтоимСтоимМатер 		= ?(ПромОкр,Окр(стрПозиции.СтоимостьБазисная,2),стрПозиции.СтоимостьБазисная);
			СтрокаРасчета.ТекСтоимСтоимМатер 	= ?(ПромОкр,Окр(стрПозиции.СтоимостьТекущая,2),стрПозиции.СтоимостьТекущая);
		ИначеЕсли стрПозиции.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Оборудование Тогда
			СтрокаРасчета.СтоимОборуд 			= ?(ПромОкр,Окр(стрПозиции.СтоимостьБазисная,2),стрПозиции.СтоимостьБазисная);
			СтрокаРасчета.ТекСтоимОборуд 		= ?(ПромОкр,Окр(стрПозиции.СтоимостьТекущая,2),стрПозиции.СтоимостьТекущая);
		ИначеЕсли стрПозиции.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
			СтрокаРасчета.ЗатратыТрудаМашин 	= Позиция.ЗатратыТрудаМашинистов;
			Если ЛС.ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Усредненный Тогда
				СтрокаРасчета.СтоимЗарплМашин 		= ?(ПромОкр,Окр(стрПозиции.СтоимостьБазиснаяЗМ,2),стрПозиции.СтоимостьБазиснаяЗМ);
				СтрокаРасчета.ТекСтоимЗарплМашин 	= ?(ПромОкр,Окр(стрПозиции.СтоимостьТекущаяЗМ,2),стрПозиции.СтоимостьТекущаяЗМ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// **************************************************************************
	// ++ AVV Ошибки учета ресурсов акта
	Если НЕ Акт = Неопределено Тогда
		ТабПоправки = Позиция.ПоправкиПозиции;
		Для Каждого ТекСтрокаПоправки Из Позиция.ПоправкиПозиции Цикл
			Если НЕ ТекСтрокаПоправки.Применить Тогда
				Продолжить;
			КонецЕсли;
			Если ТекСтрокаПоправки.КоэффТР <> 0 Тогда
				СтрокаРасчета.ЗатратыТрудаРабочих = СтрокаРасчета.ЗатратыТрудаРабочих * ТекСтрокаПоправки.КоэффТР; 	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// -- AVV
	// *************************************************************************	
	
	СтрокаРасчета.СтоимПрямЗатраты 		= СтрокаРасчета.СтоимОснЗарплата + СтрокаРасчета.СтоимЭксплМашин + СтрокаРасчета.СтоимСтоимМатер;
	СтрокаРасчета.ТекСтоимПрямЗатраты 	= СтрокаРасчета.ТекСтоимОснЗарплата + СтрокаРасчета.ТекСтоимЭксплМашин + СтрокаРасчета.ТекСтоимСтоимМатер;
	
	СтрокаРасчета.СтоимВозвратМатер  	= Позиция.ВозвратМатер;
	СтрокаРасчета.ТекСтоимВозвратМатер 	= Позиция.ВозвратМатер;
	
	СтрокаРасчета.Смета                 = СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета;
	СтрокаРасчета.Раздел                = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
	СтрокаРасчета.Позиция               = СтруктураПараметровОтбораРС.СсылкаНаПозицию;
	
	Если ИспользоватьРС Тогда
		НаборЗаписей.Загрузить(СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции);
		НаборЗаписей.Записать(истина);
	КонецЕсли;
	
	Возврат Истина; 
	
КонецФункции	

// Рассчитать оборудование.
//
Функция РасчетДляОборудования(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС = Ложь)
		
	Если ИспользоватьРС Тогда
		
		НаборЗаписей = РегистрыСведений.СМ_РесурснаяСтоимостьПозиции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции = НаборЗаписей.Выгрузить();
		
	КонецЕсли;
	
	СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Очистить();

	НоваяСтрока = СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Добавить();
	НоваяСтрока.СтоимОборуд		= Позиция.Оборудование;
	НоваяСтрока.ТекСтоимОборуд	= Позиция.ТекущаяЦена;
	НоваяСтрока.Смета                 = СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета;
	НоваяСтрока.Раздел                = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
		
	Если СтруктураПараметровОтбораРС.СсылкаНаАкт <> Неопределено Тогда
		
		ТекПозиция = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция);
		
		Если ТекПозиция <> Неопределено Тогда
			НоваяСтрока.ТекСтоимОборуд	= ТекПозиция.ТекущаяЦена;
		Иначе
			НоваяСтрока.ТекСтоимОборуд	= 0;  
		КонецЕсли;
			
	КонецЕсли;

	НоваяСтрока.Позиция         = СтруктураПараметровОтбораРС.СсылкаНаПозицию;
	
	Если ИспользоватьРС Тогда
		
		НаборЗаписей.Загрузить(СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции);
		НаборЗаписей.Записать(истина);
		
	КонецЕсли;
	
	Возврат истина;   
	
КонецФункции	

// Рассчитать стоимость материалов.
//
Функция РасчетДляМатериала(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС = Ложь)
	
	Если ИспользоватьРС Тогда
		
		НаборЗаписей = РегистрыСведений.СМ_РесурснаяСтоимостьПозиции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции = НаборЗаписей.Выгрузить();
		
	КонецЕсли;
	
	СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Очистить();	

	новаяСтрока = СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Добавить();
	новаяСтрока.СтоимСтоимМатер		= Позиция.ПрямЗатраты;
	НоваяСтрока.СтоимПрямЗатраты	= Позиция.ПрямЗатраты;
	НоваяСтрока.ТекСтоимСтоимМатер	= Позиция.ТекущаяЦена;
	НоваяСтрока.ТекСтоимПрямЗатраты	= Позиция.ТекущаяЦена;
	НоваяСтрока.СтоимВозвратМатер  	= Позиция.ВозвратМатер;
	НоваяСтрока.ТекСтоимВозвратМатер = Позиция.ВозвратМатер;
	
	НоваяСтрока.Смета                 = СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета;
	НоваяСтрока.Раздел                = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
		
	Если СтруктураПараметровОтбораРС.СсылкаНаАкт <> Неопределено Тогда
		
		ТекПозиция = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция);
		
		Если ТекПозиция <> Неопределено Тогда
			НоваяСтрока.ТекСтоимСтоимМатер	= ТекПозиция.ТекущаяЦена;
			НоваяСтрока.ТекСтоимПрямЗатраты	= ТекПозиция.ТекущаяЦена;
		Иначе
			НоваяСтрока.ТекСтоимСтоимМатер	= 0;
			НоваяСтрока.ТекСтоимПрямЗатраты	= 0;  
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрока.Позиция         	= СтруктураПараметровОтбораРС.СсылкаНаПозицию;
	
	Если ИспользоватьРС Тогда
		
		НаборЗаписей.Загрузить(СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции);
		НаборЗаписей.Записать(истина);
		
	КонецЕсли;
	
	Возврат истина; 
	
КонецФункции	

// Рассчитать прочие затраты.
//
Функция РасчетПрочего(Позиция, СтруктураДанныхРасчета, ЛС, Акт, ОбъемРабот, ПромОкр , ОкрИтог, ОбрабПогр, СтруктураПараметровОтбораРС, ИспользоватьРС = Ложь)
	
	Если ИспользоватьРС Тогда
		
		НаборЗаписей = РегистрыСведений.СМ_РесурснаяСтоимостьПозиции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции = НаборЗаписей.Выгрузить();
		
	КонецЕсли;
	
	СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Очистить();	
	
	// Судариков - сравниваем все показатели
	НоваяСтрока 						= СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Добавить();
	НоваяСтрока.СтоимЭксплМашин			= Позиция.ЭксплМашин;
	НоваяСтрока.СтоимПрямЗатраты		= Позиция.ПрямЗатраты;
	НоваяСтрока.СтоимЗарплМашин     	= Позиция.ЗарплМашинистов;
	НоваяСтрока.ТекСтоимСтоимМатер  	= Позиция.ТекущаяСтоимМатериалов;
	НоваяСтрока.ТекСтоимОснЗарплата		= Позиция.ТекущаяОснЗарплата;
	НоваяСтрока.ТекСтоимПрямЗатраты		= ?(Позиция.ТекущаяЦена = 0, Позиция.ТекущаяСтоимМатериалов + Позиция.ТекущаяОснЗарплата + Позиция.ТекущаяЭксплМашин, Позиция.ТекущаяЦена);
	НоваяСтрока.ТекСтоимЗарплМашин		= ?(ЗначениеЗаполнено(Позиция.ТекущаяЗарплМашинистов),Позиция.ТекущаяЗарплМашинистов,Позиция.ТекущаяЗарплатаМашинистов);
	
	Если ((Позиция.ТекущаяСтоимМатериалов + Позиция.ТекущаяОснЗарплата + Позиция.ТекущаяЭксплМашин) <> Позиция.ТекущаяЦена) Тогда
		НоваяСтрока.ТекСтоимЭксплМашин	= ?(ЗначениеЗаполнено(Позиция.ТекущаяЭксплМашин),Позиция.ТекущаяЭксплМашин,Позиция.ТекущаяЦена);
	Иначе
		НоваяСтрока.ТекСтоимЭксплМашин	= Позиция.ТекущаяЭксплМашин;
	КонецЕсли;
	
	НоваяСтрока.Смета  	= СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета;
	НоваяСтрока.Раздел  = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
		
	Если СтруктураПараметровОтбораРС.СсылкаНаАкт <> Неопределено Тогда
		
		ТекПозиция = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция);
		                       			
		Если ТекПозиция <> Неопределено Тогда
			
			// Не забыть вернуть ссылку на текущие, когда они появятся в позициях акта 
			НоваяСтрока.ТекСтоимСтоимМатер	= ТекПозиция.ТекущаяСтоимМатериалов;
			НоваяСтрока.ТекСтоимОснЗарплата	= ТекПозиция.ТекущаяОснЗарплата;
			НоваяСтрока.ТекСтоимПрямЗатраты	= ?(ТекПозиция.ТекущаяПрямЗатраты = 0, ТекПозиция.ТекущаяСтоимМатериалов + ТекПозиция.ТекущаяОснЗарплата + ТекПозиция.ТекущаяЭксплМашин, ТекПозиция.ТекущаяЦена);
			НоваяСтрока.ТекСтоимЗарплМашин	= ТекПозиция.ТекущаяЗарплМашинистов;

			Если ((ТекПозиция.ТекущаяСтоимМатериалов + ТекПозиция.ТекущаяОснЗарплата + ТекПозиция.ТекущаяЭксплМашин) <> ТекПозиция.ТекущаяЦена) Тогда
				НоваяСтрока.ТекСтоимЭксплМашин	= ?(ЗначениеЗаполнено(ТекПозиция.ТекущаяЭксплМашин),ТекПозиция.ТекущаяЭксплМашин,ТекПозиция.ТекущаяЦена);
			Иначе
				НоваяСтрока.ТекСтоимЭксплМашин	= ТекПозиция.ТекущаяЭксплМашин;
			КонецЕсли;
			
		Иначе
			НоваяСтрока.ТекСтоимЭксплМашин	= 0;
			НоваяСтрока.ТекСтоимЗарплМашин	= 0;
			НоваяСтрока.ТекСтоимПрямЗатраты	= 0;
			НоваяСтрока.ТекСтоимСтоимМатер	= 0;
			НоваяСтрока.ТекСтоимОснЗарплата	= 0;
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрока.Позиция = СтруктураПараметровОтбораРС.СсылкаНаПозицию;
	
	Если ИспользоватьРС Тогда
		НаборЗаписей.Загрузить(СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции);
		НаборЗаписей.Записать(истина);
	КонецЕсли;
	
	Возврат истина; 
	
КонецФункции	

#КонецОбласти
